package a3labgo.tusar.maheramadan20;

import android.graphics.Typeface;
import androidx.appcompat.app.AppCompatActivity;
import android.os.Bundle;
import android.util.TypedValue;
import android.widget.TextView;

import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.AdView;

public class OtherAreaActivity extends AppCompatActivity {
    AdView mAdView;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_other_area);
        TextView[] tv;
        TextView title;
        int total_cell=192;
        mAdView = findViewById(R.id.adView);
        AdRequest adRequest = new AdRequest.Builder().build();
        mAdView.loadAd(adRequest);

        String district[] = {"ফরিদপুর","গাজীপুর","গোপালগঞ্জ","কিশোরগঞ্জ","মাদারীপুর","মানিকগঞ্জ","মুন্সীগঞ্জ","নারায়ণগঞ্জ","নরসিংদী","রাজবাড়ী","শরীয়তপুর","টাঙ্গাইল","চট্টগ্রাম","কক্সবাজার","বান্দরবান","চাঁদপুর","ফেনী","খাগড়াছড়ি","লক্ষ্মীপুর","রাঙ্গামাটি","নোয়াখালী","কুমিল্লা","ব্রাহ্মণবাড়িয়া","সিলেট","সুনামগঞ্জ","মৌলভীবাজার","হবিগঞ্জ","ময়মনসিংহ","জামালপুর","নেত্রকোনা","শেরপুর","বরিশাল","বরগুনা","ঝালকাঠি","পিরোজপুর","পটুয়াখালী","ভোলা","খুলনা","বাগেরহাট","চুয়াডাঙ্গা","ঝিনাইদহ","যশোর","কুষ্টিয়া","মাগুরা","মেহেরপুর","নড়াইল","সাতক্ষীরা","রাজশাহী","বগুড়া","চাঁপাইনবাবগঞ্জ","জয়পুরহাট","নাটোর","নওগাঁ","পাবনা","সিরাজগঞ্জ","রংপুর","দিনাজপুর","গাইবান্ধা","কুড়িগ্রাম","লালমনিরহাট","নীলফামারী","পঞ্চগড়","ঠাকুরগাঁও"};
        String sahri_change[] = {"৩ মি. বাড়াতে হবে","১ মি. কমাতে হবে","৫ মি. বাড়াতে হবে","৪ মি. কমাতে হবে","৩ মি. বাড়াতে হবে","২ মি. বাড়াতে হবে","ঢাকার সাথে","ঢাকার সাথে","২ মি. কমাতে হবে","৪ মি. বাড়াতে হবে","২ মি. বাড়াতে হবে","ঢাকার সাথে","১ মি. কমাতে হবে","১ মি. বাড়াতে হবে","২ মি. কমাতে হবে","ঢাকার সাথে","২ মি. কমাতে হবে","৫ মি. কমাতে হবে","১ মি. বাড়াতে হবে","৩ মি. কমাতে হবে","ঢাকার সাথে","২ মি. কমাতে হবে","৪ মি. কমাতে হবে","৯ মি. কমাতে হবে","৮ মি. কমাতে হবে","৮ মি. কমাতে হবে","৬ মি. কমাতে হবে","ঢাকার সাথে","ঢাকার সাথে","৫ মি. কমাতে হবে","৩ মি. কমাতে হবে","৩ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","৪ মি. বাড়াতে হবে","৫ মি. বাড়াতে হবে","৫ মি. বাড়াতে হবে","৩ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","৫ মি. বাড়াতে হবে","৫ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","৯ মি. বাড়াতে হবে","৫ মি. বাড়াতে হবে","১ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","১ মি. বাড়াতে হবে","৪ মি. বাড়াতে হবে","৩ মি. বাড়াতে হবে","৪ মি. বাড়াতে হবে","ঢাকার সাথে","১ মি. কমাতে হবে","১ মি. বাড়াতে হবে","২ মি. কমাতে হবে","৩ মি. কমাতে হবে","৩ মি. কমাতে হবে","ঢাকার সাথে","১ মি. কমাতে হবে","১ মি. বাড়াতে হবে"};
        String iftar_change[] = {"১ মি. বাড়াতে হবে","ঢাকার সাথে","ঢাকার সাথে","১ মি. কমাতে হবে","১ মি. কমাতে হবে","১ মি. বাড়াতে হবে","২ মি. কমাতে হবে","১ মি. কমাতে হবে","২ মি. কমাতে হবে","৪ মি. বাড়াতে হবে","২ মি. কমাতে হবে","২ মি. বাড়াতে হবে","৯ মি. কমাতে হবে","১১ মি. কমাতে হবে","১১ মি. কমাতে হবে","৩ মি. কমাতে হবে","৬ মি. কমাতে হবে","৮ মি. কমাতে হবে","৪ মি. কমাতে হবে","১০ মি. কমাতে হবে","৫ মি. কমাতে হবে","৪ মি. কমাতে হবে","৩ মি. কমাতে হবে","৪ মি. কমাতে হবে","২ মি. কমাতে হবে","৫ মি. কমাতে হবে","৩ মি. কমাতে হবে","১ মি. বাড়াতে হবে","৪ মি. বাড়াতে হবে","ঢাকার সাথে","৩ মি. বাড়াতে হবে","৩ মি. কমাতে হবে","৩ মি. কমাতে হবে","২ মি. কমাতে হবে","১ মি. কমাতে হবে","৩ মি. কমাতে হবে","৪ মি. কমাতে হবে","১ মি. বাড়াতে হবে","ঢাকার সাথে","৬ মি. বাড়াতে হবে","৪ মি. বাড়াতে হবে","৩ মি. বাড়াতে হবে","৫ মি. বাড়াতে হবে","৩ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","২ মি. বাড়াতে হবে","৩ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","১০ মি. বাড়াতে হবে","৮ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","৫ মি. বাড়াতে হবে","৩ মি. বাড়াতে হবে","৮ মি. বাড়াতে হবে","১০ মি. বাড়াতে হবে","৬ মি. বাড়াতে হবে","৭ মি. বাড়াতে হবে","৮ মি. বাড়াতে হবে","১০ মি. বাড়াতে হবে","১২ মি. বাড়াতে হবে","১২ মি. বাড়াতে হবে"};


        tv = new TextView[total_cell];
        for(int i=0; i<total_cell; i++) {
            {
                String tvID = "row" + (i);
                int resID = getResources().getIdentifier(tvID, "id", getPackageName());
                tv[i] = ((TextView) findViewById(resID));
                if(i<3){
                    tv[i].setTypeface(null, Typeface.BOLD);
                    tv[i].setTextSize(TypedValue.COMPLEX_UNIT_SP, 15);
                }
                else{
                    tv[i].setTextSize(TypedValue.COMPLEX_UNIT_SP, 15);
                }

            }
        }
        title = (TextView) findViewById(R.id.title_here);
        title.setText("অন্য জেলাগুলোর সময়ের পার্থক্য");
        tv[0].setText("জেলা");
        tv[1].setText("সেহরির সময়ের পার্থক্য");
        tv[2].setText("ইফতারের সময়ের পার্থক্য");
        int j=0,k=0,l=0;
        for(int i=3; i<total_cell ; i=i+3){
            tv[i].setText(district[j]);
            j++;
        }
        for(int i=4; i<total_cell ; i=i+3){
            tv[i].setText(sahri_change[k]);
            k++;
        }
        for(int i=5; i<total_cell ; i=i+3){
            tv[i].setText(iftar_change[l]);
            l++;
        }
    }
}
