package a3labgo.tusar.maheramadan20

import a3labgo.tusar.maheramadan20.databinding.ActivityOtherAreaBinding
import android.graphics.Typeface
import android.os.Bundle
import android.util.TypedValue
import android.widget.TextView
import androidx.appcompat.app.AppCompatActivity
import com.google.android.gms.ads.AdRequest

class OtherAreaActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        val binding = ActivityOtherAreaBinding.inflate(layoutInflater)
        setContentView(binding.root)
        val tv: Array<TextView?>
        val totalCell = 192
        val adRequest = AdRequest.Builder().build()
        binding.adView.loadAd(adRequest)
        val district = arrayOf("ফরিদপুর", "গাজীপুর", "গোপালগঞ্জ", "কিশোরগঞ্জ", "মাদারীপুর", "মানিকগঞ্জ", "মুন্সীগঞ্জ", "নারায়ণগঞ্জ", "নরসিংদী", "রাজবাড়ী", "শরীয়তপুর", "টাঙ্গাইল", "চট্টগ্রাম", "কক্সবাজার", "বান্দরবান", "চাঁদপুর", "ফেনী", "খাগড়াছড়ি", "লক্ষ্মীপুর", "রাঙ্গামাটি", "নোয়াখালী", "কুমিল্লা", "ব্রাহ্মণবাড়িয়া", "সিলেট", "সুনামগঞ্জ", "মৌলভীবাজার", "হবিগঞ্জ", "ময়মনসিংহ", "জামালপুর", "নেত্রকোনা", "শেরপুর", "বরিশাল", "বরগুনা", "ঝালকাঠি", "পিরোজপুর", "পটুয়াখালী", "ভোলা", "খুলনা", "বাগেরহাট", "চুয়াডাঙ্গা", "ঝিনাইদহ", "যশোর", "কুষ্টিয়া", "মাগুরা", "মেহেরপুর", "নড়াইল", "সাতক্ষীরা", "রাজশাহী", "বগুড়া", "চাঁপাইনবাবগঞ্জ", "জয়পুরহাট", "নাটোর", "নওগাঁ", "পাবনা", "সিরাজগঞ্জ", "রংপুর", "দিনাজপুর", "গাইবান্ধা", "কুড়িগ্রাম", "লালমনিরহাট", "নীলফামারী", "পঞ্চগড়", "ঠাকুরগাঁও")
        val sahriChange = arrayOf("২ মি. বাড়াতে হবে", "ঢাকার সাথে", "৩ মি. বাড়াতে হবে", "৩ মি. কমাতে হবে", "২ মি. বাড়াতে হবে", "১ মি. বাড়াতে হবে", "ঢাকার সাথে", "ঢাকার সাথে", "১ মি. কমাতে হবে", "৪ মি. বাড়াতে হবে", "২ মি. বাড়াতে হবে", "ঢাকার সাথে", "২ মি. কমাতে হবে", "১ মি. কমাতে হবে", "৪ মি. কমাতে হবে", "ঢাকার সাথে", "২ মি. কমাতে হবে", "৫ মি. কমাতে হবে", "ঢাকার সাথে", "৪ মি. কমাতে হবে", "১ মি. কমাতে হবে", "২ মি. কমাতে হবে", "৩ মি. কমাতে হবে", "৭ মি. কমাতে হবে", "৬ মি. কমাতে হবে", "৬ মি. কমাতে হবে", "৪ মি. কমাতে হবে", "৩ মি. কমাতে হবে", "১ মি. কমাতে হবে", "৪ মি. কমাতে হবে", "১ মি. কমাতে হবে", "২ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৩ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "১ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৬ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৭ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৭ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "১ মি. বাড়াতে হবে", "৬ মি. বাড়াতে হবে", "২ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৩ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "১ মি. বাড়াতে হবে", "ঢাকার সাথে", "২ মি. বাড়াতে হবে", "১ মি. কমাতে হবে", "১ মি. কমাতে হবে", "১ মি. কমাতে হবে", "১ মি. বাড়াতে হবে", "১ মি. বাড়াতে হবে", "২ মি. বাড়াতে হবে")
        val iftarChange = arrayOf("২ মি. বাড়াতে হবে", "ঢাকার সাথে", "২ মি. বাড়াতে হবে", "ঢাকার সাথে", "১ মি. বাড়াতে হবে", "২ মি. বাড়াতে হবে", "ঢাকার সাথে", "ঢাকার সাথে", "১ মি. কমাতে হবে", "৫ মি. বাড়াতে হবে", "১ মি. কমাতে হবে", "৩ মি. বাড়াতে হবে", "৭ মি. কমাতে হবে", "১০ মি. কমাতে হবে", "১০ মি. কমাতে হবে", "২ মি. কমাতে হবে", "৪ মি. কমাতে হবে", "৭ মি. কমাতে হবে", "২ মি. কমাতে হবে", "৮ মি. কমাতে হবে", "২ মি. কমাতে হবে", "৩ মি. কমাতে হবে", "২ মি. কমাতে হবে", "৪ মি. কমাতে হবে", "১ মি. কমাতে হবে", "৩ মি. কমাতে হবে", "৩ মি. কমাতে হবে", "২ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "ঢাকার সাথে", "৩ মি. বাড়াতে হবে", "১ মি. কমাতে হবে", "ঢাকার সাথে", "ঢাকার সাথে", "ঢাকার সাথে", "১ মি. কমাতে হবে", "৩ মি. কমাতে হবে", "৩ মি. বাড়াতে হবে", "২ মি. বাড়াতে হবে", "৬ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "৬ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৭ মি. বাড়াতে হবে", "৩ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "৮ মি. বাড়াতে হবে", "৬ মি. বাড়াতে হবে", "১০ মি. বাড়াতে হবে", "৮ মি. বাড়াতে হবে", "৭ মি. বাড়াতে হবে", "৮ মি. বাড়াতে হবে", "৫ মি. বাড়াতে হবে", "৪ মি. বাড়াতে হবে", "৮ মি. বাড়াতে হবে", "১০ মি. বাড়াতে হবে", "৬ মি. বাড়াতে হবে", "৭ মি. বাড়াতে হবে", "৮ মি. বাড়াতে হবে", "১০ মি. বাড়াতে হবে", "১২ মি. বাড়াতে হবে", "১২ মি. বাড়াতে হবে")
        tv = arrayOfNulls(totalCell)
        for (i in 0 until totalCell) {
            run {
                val tvID = "row$i"
                val resID = resources.getIdentifier(tvID, "id", packageName)
                tv[i] = findViewById(resID)
                if (i < 3) {
                    tv[i]?.setTypeface(null, Typeface.BOLD)
                }
                tv[i]?.setTextSize(TypedValue.COMPLEX_UNIT_SP, 15f)
            }
        }
        binding.titleHere.setText(R.string.timeDiff)
        tv[0]?.setText(R.string.district)
        tv[1]?.setText(R.string.sehri_diff)
        tv[2]?.setText(R.string.iftar_diff)
        var j = 0
        var k = 0
        var l = 0
        run {
            var i = 3
            while (i < totalCell) {
                tv[i]!!.text = district[j]
                j++
                i += 3
            }
        }
        run {
            var i = 4
            while (i < totalCell) {
                tv[i]!!.text = sahriChange[k]
                k++
                i += 3
            }
        }
        var i = 5
        while (i < totalCell) {
            tv[i]!!.text = iftarChange[l]
            l++
            i += 3
        }
    }
}